In [1]:
import pandas as pd
import numpy as pd

In [16]:
pd.read_csv('csv_data.csv')

   Name   Age               race
0  Tigi    24   african-american
1  Mobi    27              asian
2  Waga    32             latino

In [17]:
csv_data = pd.read_csv('csv_data.csv')

In [18]:
csv_data

   Name   Age               race
0  Tigi    24   african-american
1  Mobi    27              asian
2  Waga    32             latino

In [32]:
data = pd.read_excel('excel_data.xlsx')

In [33]:
data

  Students   Height Fav_color  Salary($)
0    Gideon   170.0  Burgundy      70000
1    Mawuko   184.0     Black      20000
2       Eli   165.0      Blue      60000
3     Azuma   109.0     Brown      30000
4     Elvis   196.0    Purple      40000
5    Enerst   172.0     Green      80000
6    Steven     NaN     White      70000

In [34]:
data.Height.unique()

array([170., 184., 165., 109., 196., 172.,  nan])

In [35]:
#count null values within each column
data.isnull().sum()

Students     0
Height       1
Fav_color    0
Salary($)    0
dtype: int64

In [36]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Students   7 non-null      object
 1   Height     6 non-null      float64
 2   Fav_color  7 non-null      object
 3   Salary($)  7 non-null      int64
dtypes: float64(1), int64(1), object(2)
memory usage: 352.0+ bytes

In [37]:
data.describe()

           Height     Salary($)
count    6.000000      7.000000
mean   166.000000  52857.142857
std     30.086542  22886.885411
min    109.000000  20000.000000
25%    166.250000  35000.000000
50%    171.000000  60000.000000
75%    181.000000  70000.000000
max    196.000000  80000.000000

In [38]:
data.Height.mean()

166.0

In [39]:
data.Height.max()

196.0

In [41]:
data.Height.std()

30.086541841826886

In [42]:
#getting a dataframe using a condition
data[data['Height'] > data.Height.mean() ]

  Students   Height Fav_color  Salary($)
0    Gideon   170.0  Burgundy      70000
1    Mawuko   184.0     Black      20000
4     Elvis   196.0    Purple      40000
5    Enerst   172.0     Green      80000